#Задача1
x = int(input("Введите число х = "))
y = 7*x+5
print("Ответ y = ", y)
#Задача2
a = int(input("Введите число a = "))
p = a*4
print("Ответ a = ", a)
#Задача3
i = int(input("Введите число i = "))
I = 2*3.14
print("Ответ I = ", I)
#Задача4
S = int(input("Введите число S = "))
y = 2*2/4*3.14
print("Ответ S = ", S)
#Задача5
С = int(input("Введите число С = "))
с = 4*4+2*2
print("Ответ с = ", с)
#Задача6
T = int(input("Введите число T "))
T=2*3+2
print("Ответ T = ", T)