#Задача 3
x=int(input("Введите первое число: "))
if x<=0:
    y=x**x
else:
    y=1/x*x
    print("Ответ", y)
#Задача 4
x=int(input("Введите первое число: "))
if x<=0:
    y=x**x
else:
    y=1/x*x
    print("Ответ", y)